1c-client/src/Catalogs/AIG_Модели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AIG_Модели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Доступен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AIG_Инструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-client/src/HTTPServices/AIG_AIGateway/Ext/Module.bsl
#Область ОбщийИнтерфейс

Функция rpcPOST(Запрос)
	// Обрабатываем через унифицированную функцию
	Возврат ОбработатьJSONRPCЗапрос(Запрос);
КонецФункции

Функция healthGET(Запрос)
	ОтветДанные = Новый Структура;
	ОтветДанные.Вставить("status", "ok");
	
	JSONСтрока = AIG_ОбщегоНазначения.ДанныеВJSON(ОтветДанные);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(JSONСтрока, КодировкаТекста.UTF8);
	
	Возврат Ответ;
КонецФункции

Функция mcpPOST(Запрос)
	// Обрабатываем MCP Streamable HTTP запросы через унифицированную функцию
	Возврат ОбработатьJSONRPCЗапрос(Запрос);
КонецФункции

Функция mcpGET(Запрос)
	// GET не поддерживается для MCP эндпоинта согласно спецификации
	Ответ = Новый HTTPСервисОтвет(405);
	Ответ.Заголовки.Вставить("Allow", "POST");
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область УнифицированнаяОбработкаJSONRPC

Функция ОбработатьJSONRPCЗапрос(Запрос)
	// Унифицированная обработка JSON-RPC запросов для /rpc и /mcp эндпоинтов
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	// Добавляем CORS заголовки для совместимости с браузерными клиентами
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	
	Попытка
		// Получаем тело запроса
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		
		// Парсим JSON-RPC запрос
		ЗапросДанные = AIG_ОбщегоНазначения.JSONВСтруктуру(ТелоЗапроса);
		
		// Для notifications (запросы без id) сразу возвращаем 204 No Content
		Если НЕ ЗапросДанные.Свойство("id") Тогда
			Возврат СформироватьОтвет204();
		КонецЕсли;
		
		ИдентификаторЗапроса = ЗапросДанные.id;
		
		// Проверяем версию JSON-RPC
		Если ЗапросДанные.Свойство("jsonrpc") И ЗапросДанные.jsonrpc <> "2.0" Тогда
			Возврат СформироватьJSONОшибку(Ответ, ИдентификаторЗапроса, -32600, "Неподдерживаемая версия JSON-RPC");
		КонецЕсли;
		
		// Получаем метод
		Метод = "";
		Если ЗапросДанные.Свойство("method") Тогда
			Метод = ЗапросДанные.method;
		КонецЕсли;
		
		// Получаем параметры
		Параметры = Новый Структура;
		Если ЗапросДанные.Свойство("params") Тогда
			Параметры = ЗапросДанные.params;
		КонецЕсли;
		
		// Маршрутизация по методам
		Результат = Неопределено;
		
		Если Метод = "initialize" Тогда
			Результат = ОбработатьInitialize(Параметры);
		ИначеЕсли Метод = "tools/list" Тогда
			Результат = ПолучитьСписокИнструментов(Параметры);
		ИначеЕсли Метод = "tools/call" Тогда
			Результат = ВызватьИнструмент(Параметры);
		ИначеЕсли Метод = "resources/list" Тогда
			Результат = ПолучитьСписокРесурсов(Параметры);
		ИначеЕсли Метод = "resources/read" Тогда
			Результат = ПолучитьРесурс(Параметры);
		//ИначеЕсли Метод = "prompts/list" Тогда
		//	Результат = ПолучитьСписокПромптов(Параметры);
		//ИначеЕсли Метод = "prompts/get" Тогда
		//	Результат = ПолучитьПромпт(Параметры);
		Иначе
			// Неизвестный метод
			Возврат СформироватьJSONОшибку(Ответ, ИдентификаторЗапроса, -32601, "Неизвестный метод: " + Метод);
		КонецЕсли;
		
		// Формируем успешный ответ
		Возврат СформироватьJSONУспех(Ответ, ИдентификаторЗапроса, Результат);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Возврат СформироватьJSONОшибку(Ответ, ИдентификаторЗапроса, -32603, "Внутренняя ошибка сервера: " + ОписаниеОшибки);
	КонецПопытки;
КонецФункции

Функция ОбработатьInitialize(Параметры)
	
	Результат = Новый Структура;
	
	Результат.Вставить("protocolVersion", "2026-06-01");
	
	ВозможностиИнструментов = Новый Структура;
	ВозможностиИнструментов.Вставить("listChanged", Ложь);
	ВозможностиИнструментов.Вставить("call", Истина);
	
	ВозможностиРесурсов = Новый Структура;
	ВозможностиРесурсов.Вставить("listChanged", Ложь);
	ВозможностиРесурсов.Вставить("subscribe", Ложь);
	
	ВозможностиПромптов = Новый Структура;
	ВозможностиПромптов.Вставить("listChanged", Ложь);
	
	Возможности = Новый Структура;
	Возможности.Вставить("tools", 		ВозможностиИнструментов);
	Возможности.Вставить("resources", 	ВозможностиРесурсов);
	Возможности.Вставить("prompts", 	ВозможностиПромптов);
	
	Результат.Вставить("capabilities", Возможности);
	
	// Информация о сервере
	ИнформацияСервера = Новый Структура;
	ИнформацияСервера.Вставить("name", "1C AI Gateway");
	ИнформацияСервера.Вставить("version", "1.0.0");
	
	Результат.Вставить("serverInfo", ИнформацияСервера);
	
	Возврат Результат;
КонецФункции

Функция СформироватьJSONУспех(HTTPОтвет, ИдентификаторЗапроса, Результат)
	// Формирует успешный JSON-RPC ответ
	
	ОтветУспех = Новый Структура;
	ОтветУспех.Вставить("jsonrpc", "2.0");
	ОтветУспех.Вставить("id", ИдентификаторЗапроса);
	ОтветУспех.Вставить("result", Результат);
	
	HTTPОтвет.УстановитьТелоИзСтроки(AIG_ОбщегоНазначения.ДанныеВJSON(ОтветУспех), КодировкаТекста.UTF8);
	
	Возврат HTTPОтвет;
КонецФункции

Функция СформироватьJSONОшибку(HTTPОтвет, ИдентификаторЗапроса, КодОшибки, СообщениеОшибки)
	// Формирует JSON-RPC ответ с ошибкой
	
	ОтветОшибка = СформироватьОтветОшибку(КодОшибки, СообщениеОшибки, ИдентификаторЗапроса);
	HTTPОтвет.УстановитьТелоИзСтроки(AIG_ОбщегоНазначения.ДанныеВJSON(ОтветОшибка), КодировкаТекста.UTF8);
	
	Возврат HTTPОтвет;
КонецФункции

Функция СформироватьОтвет204()
	// Формирует ответ 204 No Content для notifications
	
	Ответ = Новый HTTPСервисОтвет(204);
	Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область Инструменты

Функция ПолучитьСписокИнструментов(Параметры)
	
	Результат = Новый Структура;
	ИнструментыМассив = Новый Массив;
	
	ДоступныеИнструменты = Новый Массив;
	ОсновнаяМодель = Константы.AIG_ОсновнаяМодель.Получить();
	Если ЗначениеЗаполнено(ОсновнаяМодель) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	AIG_МоделиИнструменты.Имя КАК Имя
		|ИЗ
		|	Справочник.AIG_Модели.Инструменты КАК AIG_МоделиИнструменты
		|ГДЕ
		|	AIG_МоделиИнструменты.Ссылка = &Ссылка
		|	И AIG_МоделиИнструменты.Доступен";
		
		Запрос.УстановитьПараметр("Ссылка", ОсновнаяМодель);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ДоступныеИнструменты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Имя");
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаИнструментов = AIG_ИнструментыПовтИсп.Инструменты();
	
	Для Каждого СтрокаИнструмента Из ТаблицаИнструментов Цикл
		
		Если ЗначениеЗаполнено(ДоступныеИнструменты)
			И ДоступныеИнструменты.Найти(СтрокаИнструмента.Имя) = Неопределено Тогда
			
			Продолжить;
		КонецЕсли;
		
		ИнструментТип = Новый Структура;
		ИнструментТип.Вставить("type", "function");
		
		Инструмент = Новый Структура;
		Инструмент.Вставить("name", СтрокаИнструмента.Имя);
		Инструмент.Вставить("description", СтрокаИнструмента.Описание);
		
		СхемаПараметров = Новый Структура;
		Если ЗначениеЗаполнено(СтрокаИнструмента.СхемаПараметров) Тогда
			Попытка
				СхемаПараметров = AIG_ОбщегоНазначения.JSONВСтруктуру(СтрокаИнструмента.СхемаПараметров);
			Исключение
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ТекстОшибки = СтрШаблон("Ошибка чтения JSON схемы параметров для инструмента '%1': %2", 
					СтрокаИнструмента.Имя, 
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
		КонецЕсли;
		
		Инструмент.Вставить("parameters", СхемаПараметров);
		
		ИнструментТип.Вставить("function", Инструмент);
		
		ИнструментыМассив.Добавить(ИнструментТип);
	КонецЦикла;
	
	Результат.Вставить("tools", ИнструментыМассив);
	
	Возврат Результат;
КонецФункции

Функция ВызватьИнструмент(Параметры)
	// Выполняет инструмент из контейнеров
	// Параметры содержат:
	// - name (строка): имя инструмента для вызова
	// - arguments (структура): аргументы для инструмента
	//
	// Возвращает структуру с полями:
	// - content (массив): содержимое результата
	//   Каждый элемент содержит:
	//   - type ("text" или "image"): тип содержимого
	//   - text (строка): текст для типа "text"
	//   - data (строка): данные изображения в base64 для типа "image"
	//   - mimeType (строка): MIME-тип для изображений
	// - isError (булево): признак ошибки
	
	ИмяИнструмента = "";
	Если Параметры.Свойство("name") Тогда
		ИмяИнструмента = Параметры.name;
	КонецЕсли;
	
	АргументыИнструмента = Новый Структура;
	Если Параметры.Свойство("arguments") Тогда
		АргументыИнструмента = Параметры.arguments;
	КонецЕсли;
	
	// Проверяем обязательные параметры
	Если НЕ ЗначениеЗаполнено(ИмяИнструмента) Тогда
		ВызватьИсключение "Не указано имя инструмента для вызова";
	КонецЕсли;
	
	// Получаем таблицу инструментов и ищем нужный
	ТаблицаИнструментов = AIG_ИнструментыПовтИсп.Инструменты();
	СтрокаИнструмента = ТаблицаИнструментов.Найти(ИмяИнструмента, "Имя");
	
	Если СтрокаИнструмента = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Инструмент '%1' не найден", ИмяИнструмента);
	КонецЕсли;
	
	Результат = Новый Структура;
	Содержимое = Новый Массив;
	ПризнакОшибки = Ложь;
	
	Попытка
		// Выполняем инструмент через модуль выполнения
		РезультатВыполнения = AIG_Инструменты.ВыполнитьИнструмент(СтрокаИнструмента, АргументыИнструмента);
		
		// Преобразуем результат в формат MCP
		Если ТипЗнч(РезультатВыполнения) = Тип("Массив") Тогда
			// Результат уже в формате массива элементов содержимого
			Для Каждого Элемент Из РезультатВыполнения Цикл
				Если ТипЗнч(Элемент) = Тип("Структура") И Элемент.Свойство("type") Тогда
					Содержимое.Добавить(Элемент);
				ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
					Содержимое.Добавить(Элемент);
				Иначе
					// Преобразуем произвольный элемент в текстовый
					ЭлементСодержимого = Новый Структура;
					ЭлементСодержимого.Вставить("type", "text");
					ЭлементСодержимого.Вставить("text", Строка(Элемент));
					Содержимое.Добавить(ЭлементСодержимого);
				КонецЕсли;
			КонецЦикла;
		Иначе
			// Результат - одиночное значение, преобразуем в текст
			ЭлементСодержимого = Новый Структура;
			ЭлементСодержимого.Вставить("type", "text");
			ЭлементСодержимого.Вставить("text", Строка(РезультатВыполнения));
			Содержимое.Добавить(ЭлементСодержимого);
		КонецЕсли;
		
	Исключение
		ПризнакОшибки = Истина;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ЭлементОшибки = Новый Структура;
		ЭлементОшибки.Вставить("type", "text");
		ЭлементОшибки.Вставить("text", 
			СтрШаблон("Ошибка выполнения инструмента '%1': %2", 
				ИмяИнструмента, 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
		
		Содержимое.Добавить(ЭлементОшибки);
	КонецПопытки;
	
	Результат.Вставить("content", Содержимое);
	Результат.Вставить("isError", ПризнакОшибки);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область Ресурсы

Функция ПолучитьСписокРесурсов(Параметры)
	// Получает список доступных ресурсов из контейнеров
	// Возвращает структуру с полем "resources" - массив ресурсов
	// Каждый ресурс содержит:
	// - uri (строка): URI ресурса
	// - name (строка): имя ресурса
	// - description (строка): описание ресурса
	// - mimeType (строка): MIME-тип ресурса (опционально)
	
	Результат = Новый Структура;
	Ресурсы = Новый Массив;
	
	// Получаем таблицу ресурсов из контейнеров
	ТаблицаРесурсов = AIG_РесурсыПовтИсп.Ресурсы();
	
	// Преобразуем таблицу в массив структур для JSON-RPC ответа
	Для Каждого СтрокаРесурса Из ТаблицаРесурсов Цикл
		
		Ресурс = Новый Структура;
		Ресурс.Вставить("uri", СтрокаРесурса.Адрес);
		Ресурс.Вставить("name", СтрокаРесурса.Имя);
		Ресурс.Вставить("description", СтрокаРесурса.Описание);
		
		// mimeType не хранится в таблице ресурсов, поэтому не указываем
		// При необходимости можно будет добавить в схему таблицы
		
		Ресурсы.Добавить(Ресурс);
		
	КонецЦикла;
	
	Результат.Вставить("resources", Ресурсы);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьРесурс(Параметры)
	// Читает содержимое ресурса из контейнеров
	// Параметры содержат:
	// - uri (строка): URI ресурса для получения
	//
	// Возвращает структуру с полем "contents" - массив содержимого
	// Каждый элемент содержит:
	// - type ("text" или "blob"): тип содержимого
	// - mimeType (строка): MIME-тип содержимого
	// - text (строка): текстовое содержимое для типа "text"
	// - blob (строка): двоичные данные в base64 для типа "blob"
	
	URIРесурса = "";
	Если Параметры.Свойство("uri") Тогда
		URIРесурса = Параметры.uri;
	КонецЕсли;
	
	// Проверяем обязательные параметры
	Если НЕ ЗначениеЗаполнено(URIРесурса) Тогда
		ВызватьИсключение "Не указан URI ресурса для чтения";
	КонецЕсли;
	
	// Получаем таблицу ресурсов и ищем нужный
	ТаблицаРесурсов = AIG_РесурсыПовтИсп.Ресурсы();
	СтрокаРесурса = ТаблицаРесурсов.Найти(URIРесурса, "Адрес");
	
	Если СтрокаРесурса = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Ресурс '%1' не найден", URIРесурса);
	КонецЕсли;
	
	Результат = Новый Структура;
	Содержимое = Новый Массив;
	
	Попытка
		// Читаем ресурс через модуль выполнения
		СодержимоеРесурса = AIG_Ресурсы.ПрочитатьРесурс(СтрокаРесурса, URIРесурса);
		
		// Преобразуем результат в формат MCP
		Если ТипЗнч(СодержимоеРесурса) = Тип("Массив") Тогда
			// Содержимое уже в формате массива элементов
			Для Каждого Элемент Из СодержимоеРесурса Цикл
				Если ТипЗнч(Элемент) = Тип("Структура") И Элемент.Свойство("type") Тогда
					// Добавляем uri, если его нет
					Если НЕ Элемент.Свойство("uri") Тогда
						Элемент.Вставить("uri", URIРесурса);
					КонецЕсли;
					Содержимое.Добавить(Элемент);
				Иначе
					// Преобразуем произвольный элемент в текстовый
					ЭлементСодержимого = Новый Структура;
					ЭлементСодержимого.Вставить("type", "text");
					ЭлементСодержимого.Вставить("uri", URIРесурса);
					ЭлементСодержимого.Вставить("mimeType", "text/plain");
					ЭлементСодержимого.Вставить("text", Строка(Элемент));
					Содержимое.Добавить(ЭлементСодержимого);
				КонецЕсли;
			КонецЦикла;
		Иначе
			// Содержимое - одиночное значение, преобразуем в текст
			ЭлементСодержимого = Новый Структура;
			ЭлементСодержимого.Вставить("type", "text");
			ЭлементСодержимого.Вставить("uri", URIРесурса);
			ЭлементСодержимого.Вставить("mimeType", "text/plain");
			ЭлементСодержимого.Вставить("text", Строка(СодержимоеРесурса));
			Содержимое.Добавить(ЭлементСодержимого);
		КонецЕсли;
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон("Ошибка чтения ресурса '%1': %2", 
			URIРесурса, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Результат.Вставить("contents", Содержимое);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

Функция СформироватьОтветОшибку(КодОшибки, СообщениеОшибки, ИдентификаторЗапроса)
	ОтветОшибка = Новый Структура;
	ОтветОшибка.Вставить("jsonrpc", "2.0");
	ОтветОшибка.Вставить("id", ИдентификаторЗапроса);
	
	Ошибка = Новый Структура;
	Ошибка.Вставить("code", КодОшибки);
	Ошибка.Вставить("message", СообщениеОшибки);
	
	ОтветОшибка.Вставить("error", Ошибка);
	
	Возврат ОтветОшибка;
КонецФункции

#КонецОбласти
